tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "caskroom/cask"
brew "ack"
brew "ant"
brew "readline"
brew "sqlite"
brew "python"
brew "asciinema"
brew "automake"
brew "awscli"
brew "bash"
brew "cmake"
brew "coreutils"
brew "curl", link: true
brew "ffmpeg"
brew "gcc"
brew "gdb"
brew "git"
brew "gradle"
brew "node"
brew "heroku"
brew "htop"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "irssi"
brew "jq"
brew "mas"
brew "maven"
brew "mongodb", restart_service: true
brew "mysql", restart_service: true
brew "nmap"
brew "packer"
brew "postgresql", restart_service: true
brew "protobuf"
brew "pyenv"
brew "rbenv"
brew "redis", restart_service: true
brew "ruby"
brew "terraform"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "unrar"
brew "vault"
brew "vim", args: ["with-override-system-vi"]
brew "watch"
brew "watchman"
brew "wget"
brew "youtube-dl"
cask "alfred"
cask "android-platform-tools"
cask "android-sdk"
cask "android-studio"
cask "appcleaner"
cask "clipy"
cask "cloudapp"
cask "docker"
cask "dropbox"
cask "evernote"
cask "firefox"
cask "flux"
cask "google-backup-and-sync"
cask "google-chrome"
cask "handbrake"
cask "intellij-idea"
cask "intellij-idea-ce"
cask "iterm2"
cask "lastpass"
cask "macdown"
cask "macvim"
cask "postman"
cask "skype"
cask "slack"
cask "sourcetree"
cask "spectacle"
cask "spotify"
cask "sublime-text"
cask "the-unarchiver"
cask "vagrant"
cask "vagrant-manager"
cask "virtualbox"
cask "vlc"
cask "caskroom/versions/java8"
mas "Amphetamine", id: 937984704
mas "Xcode", id: 497799835
