########################################################################
# Taps                                                                 #
########################################################################
tap "heroku/brew"
tap "mongodb/brew"

########################################################################
# CLI                                                                  #
########################################################################
brew "ack"
brew "readline"
brew "sqlite"
brew "python"
brew "ant"
brew "automake"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bash-completion@2"
brew "docker-completion"
brew "docker-compose-completion"
brew "gradle-completion"
brew "pip-completion"
brew "maven-completion"
brew "spring-completion"
brew "autojump"
brew "wireshark"
brew "cassandra"
brew "cmake"
brew "consul"
brew "coreutils"
brew "curl", link: true
brew "ffmpeg"
brew "findutils"
brew "gcc"
brew "gdb"
brew "git"
brew "gradle"
brew "node"
brew "heroku"
brew "htop"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "irssi"
brew "jq"
brew "mas"
brew "maven"
brew "memcached"
brew "mongodb-community"
brew "moreutils"
brew "mysql@5.7", restart_service: true # 8.0 is not ready for mac
brew "nmap"
brew "nomad"
brew "openssl"
brew "packer"
brew "postgresql", restart_service: true
brew "protobuf"
brew "ruby"
brew "pyenv"
brew "rbenv"
brew "redis", restart_service: true
brew "terraform"
brew "the_silver_searcher"
brew "transmission"
brew "tmux"
brew "tree"
brew "unrar"
brew "vault"
brew "vim"
brew "watch"
brew "watchman"
brew "wget"

########################################################################
# Apps                                                                 #
########################################################################
cask "alfred"
cask "clipy"
cask "discord"
cask "docker"
cask "dropbox"
cask "evernote"
cask "firefox"
cask "flux"
cask "google-backup-and-sync"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "mysqlworkbench"
cask "imageoptim"
cask "iterm2"
cask "lastpass"
cask "macdown"
cask "macvim"
cask "microsoft-office"
cask "postman"
cask "sequel-pro"
cask "slack"
cask "spectacle"
cask "spotify"
cask "sublime-text"
cask "the-unarchiver"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visualvm"
cask "vlc"
cask "whatsapp"
