########################################################################
# Taps                                                                 #
########################################################################
tap "hashicorp/tap"
tap "heroku/brew"
tap "mongodb/brew"

########################################################################
# CLI                                                                  #
########################################################################
brew "ack"
brew "ansible"
brew "ant"
brew "autojump"
brew "automake"
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "cassandra"
brew "cmake"
brew "codex"
brew "composer"
brew "consul"
brew "coreutils"
brew "curl", link: true
brew "docker-completion"
brew "ffmpeg"
brew "findutils"
brew "gcc"
brew "gdb"
brew "gh"
brew "git"
brew "gradle"
brew "gradle-completion"
brew "grpc"
brew "heroku"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "irssi"
brew "jq"
brew "maven"
brew "maven-completion"
brew "memcached"
brew "mongodb-community"
brew "mongodb-database-tools"
brew "moreutils"
brew "mariadb", restart_service: true
brew "mysql@8.0", restart_service: true
brew "nmap"
brew "node"
brew "nomad"
brew "ollama"
brew "openssl"
brew "packer"
brew "php"
brew "pip-completion"
brew "postgresql@17", restart_service: true
brew "protobuf"
brew "pyenv"
brew "rbenv"
brew "readline"
brew "redis", restart_service: true
brew "ripgrep"
brew "ruby"
brew "spring-completion"
brew "sqlite"
brew "terraform"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vault"
brew "vim"
brew "watch"
brew "watchman"
brew "wget"
brew "wireshark"

########################################################################
# Apps                                                                 #
########################################################################
cask "alacritty"
cask "alfred"
cask "discord"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "github"
cask "imageoptim"
cask "iterm2"
cask "jetbrains-toolbox"
cask "localsend"
cask "maccy"
cask "ngrok"
cask "notion"
cask "obsidian"
cask "ollama-app"
cask "proxyman"
cask "rectangle"
cask "signal"
cask "slack"
cask "spotify"
cask "stats"
cask "the-unarchiver"
cask "visual-studio-code"
cask "visualvm"
cask "vlc"
cask "whatsapp"
cask "zed"
cask "zoom"
